views/user/notes.php

    </div>
    <div style="position:relative; width: 73%; float:left;">
        <?php
            $notes = $model->getNotes()->orderBy('note_id')->all();
            for($i = 0; $i < $model->getNotes()->count(); $i++)
---
SELECT * FROM `notes` WHERE `user_id`=6 ORDER BY `note_id`
SELECT COUNT(*) FROM `notes` WHERE `user_id`=6