views/user/weeks.php

SELECT * FROM `weeks` ORDER BY `week_id`
SELECT COUNT(*) FROM `weeks` ORDER BY `week_id`
---
    </div>
    <div style="position:relative; width: 73%; float:left;">
        <?php
            $weeks = $model->getWeeks()->orderBy('week_id')->all();
            for($i = 0; $i < $model->getWeeks()->count(); $i++)