controllers/UserController.php

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `users` WHERE `id`='undefined'