models/User.php

    public static function findByEmail($email)
    {
        $user = User::find()->where(['email' => $email])->one();
---
SELECT * FROM `users` WHERE `email`='lena@gmail.com'

     public static function findIdentity($id)
    {
        $user = User::find()->where(['id' => $id - 3010])->one();
---
SELECT * FROM `users` WHERE `id`=6